Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31032_SL3.svd
            <register>
               <name>ADCDMABCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x334</addressOffset>
            </register>
            <register>
               <name>ADCDMABSET</name>
               <description>Bit set register</description>
               <addressOffset>0x338</addressOffset>
            </register>
            <register>
               <name>ADCDMABINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x33c</addressOffset>
            </register>
            <register>
               <name>ADCTRGSNSCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x344</addressOffset>
            </register>
            <register>
               <name>ADCTRGSNSSET</name>
               <description>Bit set register</description>
               <addressOffset>0x348</addressOffset>
            </register>
            <register>
               <name>ADCTRGSNSINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x34c</addressOffset>
            </register>
            <register>
               <name>ADC0TIMECLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x354</addressOffset>
            </register>
            <register>
               <name>ADC0TIMESET</name>
               <description>Bit set register</description>
               <addressOffset>0x358</addressOffset>
            </register>
            <register>
               <name>ADC0TIMEINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x35c</addressOffset>
            </register>
            <register>
               <name>ADCEISTAT1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x3e4</addressOffset>
            </register>
            <register>
               <name>ADCEISTAT1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x3e8</addressOffset>
            </register>
            <register>
               <name>ADCEISTAT1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x3ec</addressOffset>
            </register>
            <register>
               <name>ADCANLCTLCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x404</addressOffset>
            </register>
            <register>
               <name>ADCANLCTLSET</name>
               <description>Bit set register</description>
               <addressOffset>0x408</addressOffset>
            </register>
            <register>
               <name>ADCANLCTLINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x40c</addressOffset>
            </register>
            <register>
               <name>ADCFGSHRCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x674</addressOffset>
            </register>
            <register>
               <name>ADCFGSHRSET</name>
               <description>Bit set register</description>
               <addressOffset>0x678</addressOffset>
            </register>
            <register>
               <name>ADCFGSHRINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x67c</addressOffset>
            </register>
            <register>
               <name>ADCSVCONCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x684</addressOffset>
            </register>
            <register>
               <name>ADCSVCONSET</name>
               <description>Bit set register</description>
               <addressOffset>0x688</addressOffset>
            </register>
            <register>
               <name>ADCSVCONINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x68c</addressOffset>
            </register>
            <register>
               <name>ADCSYSCFG0CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x704</addressOffset>
            </register>
            <register>
               <name>ADCSYSCFG0SET</name>
               <description>Bit set register</description>
               <addressOffset>0x708</addressOffset>
            </register>
            <register>
               <name>ADCSYSCFG0INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x70c</addressOffset>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>ARB</name>
         <version>042691.0</version>
         <description>Radio Arbiter</description>
         <baseAddress>0x41011000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ARBITER</name>
            <description>Radio Arbiter</description>
            <value>33</value>
         </interrupt>
         <registers>
            <register>
               <name>BT_CTRL</name>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>MAX_ABORT_TIME_BT</name>
                     <description>BT max abort time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOW_OPT_RX_BT</name>
                     <description>BT allow optimistic rx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALLOW_OPT_TX_BT</name>
                     <description>BT allow optimistic tx</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ZB_CTRL</name>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>MAX_ABORT_TIME_ZB</name>
                     <description>ZB max abort time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOW_OPT_RX_ZB</name>
                     <description>ZB allow optimistic rx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALLOW_OPT_TX_ZB</name>
                     <description>ZB allow optimistic tx</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVENT_CTRL</name>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>START_TIME_ALLOWANCE</name>
                     <description>minimum change needed in the start time to be considered as an arbitration event.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USE_END_TIME_AS_EVENT</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USE_START_TIME_AS_EVENT</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USE_PRIO_AS_EVENT</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DELAYED_OK_TASKS_DONT_WAIT</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RESOLVE_EQUAL_PRIO</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ABORT_IN_STATIC_MODE</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CORE_CTRL</name>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x00000140</resetValue>
               <fields>
                  <field>
                     <name>RADIO_ARB_MODE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TESTBUS_SELECT</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CFG_CDC_ADJ_VAL</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AD_ARB_SOFT_RESET</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARB_TESTBUS_BYTE_SELECT</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RESERVED_1</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>RAD_ARB_TIMEOUT</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CORE_STATUS</name>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ARB_CORE_STATE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>NEXT_RADIO_OWNER</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CUR_RADIO_OWNER</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CUR_REQ_PRI</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT_STATUS</name>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BT_ABORT_HIZB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_ABORT_HIBT</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BT_RADIO_TO_ABRT</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_RADIO_TO_ABRT</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BT_TIMESENSE_REQ_LOSS</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_TIMESENSE_REQ_LOSS</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COLLISION_PREDICTED</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARB_IDLE</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT_MASK</name>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>BT_ABORT_HIZB_MSK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_ABORT_HIBT_MSK</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BT_RADIO_TO_ABRT_MSK</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_RADIO_TO_ABRT_MSK</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BT_TIMESENSE_REQ_LOSS_MSK</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_TIMESENSE_REQ_LOSS_MSK</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COLLISION_PREDICTED_MSK</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARB_IDLE_MSK</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
