Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31032_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>BLE</name>
         <version>049991.0</version>
         <description>BLE</description>
         <baseAddress>0x41012000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4BC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>BT_INT0</name>
            <description>Bluetooth 0</description>
            <value>31</value>
         </interrupt>
         <interrupt>
            <name>BT_INT1</name>
            <description>Bluetooth 1</description>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>CLKI_WAKEUP_NMI</name>
            <description>WSS WAKEUP</description>
            <value>37</value>
         </interrupt>
         <interrupt>
            <name>BT_LC</name>
            <description>Bluetooth LC</description>
            <value>42</value>
         </interrupt>
         <registers>
            <register>
               <name>DPLL_RG1</name>
               <addressOffset>0x04B8</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>DPLL_RG1BITS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLL_RG2</name>
               <addressOffset>0x04BA</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>DPLL_RG2BITS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>BTZBSYS</name>
         <version>049971.0.0</version>
         <description>BT ZB Subsystem</description>
         <baseAddress>0x41014000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SUBSYS_CNTRL_REG0</name>
               <description>SUBSYS_CNTRL_REG0</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ant_div_sel_ovrd_en</name>
                     <description>ant_div_sel_ovrd_en</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ant_div_sel_ovrd_val</name>
                     <description>ant_div_sel_ovrd_val</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>disable_pclk_bt</name>
                     <description>disable_pclk_bt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>disable_pclk_zb_mac</name>
                     <description>disable_pclk_zb_mac</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>disable_pclk_arb</name>
                     <description>disable_pclk_arb</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_sel</name>
                     <description>subsys_dbg_bus_sel</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>aclb_pwr_rst_n</name>
                     <description>aclb_pwr_rst_n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>aclb_soft_rst_n</name>
                     <description>aclb_soft_rst_n</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_sel_top</name>
                     <description>subsys_dbg_bus_sel_top</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_en_main_clk</name>
                     <description>bt_en_main_clk</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_reset_by_fw</name>
                     <description>bt_reset_by_fw</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_hw_rc_re_cal</name>
                     <description>bt_hw_rc_re_cal</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_sfr_wakeup_bit</name>
                     <description>bt_sfr_wakeup_bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_pdc_ov</name>
                     <description>bt_pdc_ov</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ant_div_sel_2_iom_en</name>
                     <description>ant_div_sel_2_iom_en</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ant_div_sel_1_iom_en</name>
                     <description>ant_div_sel_1_iom_en</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_en_main_clk</name>
                     <description>zb_en_main_clk</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_reset_by_fw</name>
                     <description>zb_reset_by_fw</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_soft_reset_in</name>
                     <description>zb_soft_reset_in</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_slp_ctrl</name>
                     <description>zb_slp_ctrl</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_CNTRL_REG1</name>
               <description>SUBSYS_CNTRL_REG1</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x00001800</resetValue>
               <fields>
                  <field>
                     <name>disable_adc_clk_gating</name>
                     <description>disable_adc_clk_gating</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>die_clk_sel</name>
                     <description>die_clk_sel</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_flops_rstn_ovrd_val</name>
                     <description>pll_lock_flops_rstn_ovrd_val</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_flops_rstn_ovrd_en</name>
                     <description>pll_lock_flops_rstn_ovrd_en</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>xtal_lock_cnt_rstn_ovrd_val</name>
                     <description>xtal_lock_cnt_rstn_ovrd_val</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>xtal_lock_cnt_rstn_ovrd_en</name>
                     <description>xtal_lock_cnt_rstn_ovrd_en</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>clk_lp_req</name>
                     <description>clk_lp_req</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>invert_btadc_clk</name>
                     <description>invert_btadc_clk</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_bt_bar_ovrd_val</name>
                     <description>zb_bt_bar_ovrd_val</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_bt_bar_ovrd_en</name>
                     <description>zb_bt_bar_ovrd_en</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>lna_on_iom_en</name>
                     <description>lna_on_iom_en</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pa_on_iom_en</name>
                     <description>pa_on_iom_en</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>tr_sw_n_iom_en</name>
                     <description>tr_sw_n_iom_en</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>tr_sw_iom_en</name>
                     <description>tr_sw_iom_en</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_xtal_ready_delay</name>
                     <description>subsys_xtal_ready_delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_en</name>
                     <description>subsys_dbg_bus_en</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>disable_one_sec_counter</name>
                     <description>disable_one_sec_counter</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ssubsys_clk_div_sel</name>
                     <description>subsys_clk_div_sel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_clk_src_sel</name>
                     <description>subsys_clk_src_sel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_sel</name>
                     <description>subsys_dbg_bus_sel</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_sel_top</name>
                     <description>subsys_dbg_bus_sel_top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_CNTRL_REG2</name>
               <description>SUBSYS_CNTRL_REG2</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>crossbar_data_invert</name>
                     <description>crossbar_data_invert</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>crossbar_data_line_sel_5</name>
                     <description>crossbar_data_line_sel_5</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>crossbar_data_line_sel_4</name>
                     <description>crossbar_data_line_sel_4</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>crossbar_data_line_sel_3</name>
                     <description>crossbar_data_line_sel_3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>crossbar_data_line_sel_2</name>
                     <description>crossbar_data_line_sel_2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>crossbar_data_line_sel_1</name>
                     <description>crossbar_data_line_sel_1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>crossbar_data_line_sel_0</name>
                     <description>crossbar_data_line_sel_0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_CNTRL_REG3</name>
               <description>SUBSYS_CNTRL_REG3</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x00000240</resetValue>
               <fields>
                  <field>
                     <name>pll_lock_fifo_empty_rst_en</name>
                     <description>pll_lock_fifo_empty_rst_en</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_fifo_clk_src_sel</name>
                     <description>pll_lock_fifo_clk_src_sel</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_fifo_empty_soft_reset</name>
                     <description>pll_lock_fifo_empty_soft_reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_auto_relock_en</name>
                     <description>pll_auto_relock_en</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_fifo_en</name>
                     <description>pll_lock_fifo_en</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>disable_pclk_zb_mdm</name>
                     <description>disable_pclk_zb_mdm</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>disable_pclk_dfe</name>
                     <description>disable_pclk_dfe</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_pll_ready_delay</name>
                     <description>subsys_pll_ready_delay</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>le_2m_fpga_v1c0_mode</name>
                     <description>le_2m_fpga_v1c0_mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_STATUS_REG0</name>
               <description>SUBSYS_STATUS_REG0</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>bt_rf_idle</name>
                     <description>bt_rf_idle</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_low_power_mode</name>
                     <description>bt_low_power_mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>radio_idle_zb</name>
                     <description>radio_idle_zb</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_deep_sleep_mode</name>
                     <description>zb_deep_sleep_mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_sleep_mode</name>
                     <description>zb_sleep_mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_STATUS_REG1</name>
               <description>SUBSYS_STATUS_REG1</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>pllc_ready_cnt_expire_raw</name>
                     <description>pllc_ready_cnt_expire_raw</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_fifo_empty</name>
                     <description>XTAL_ready</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>clk_mux_sel</name>
                     <description>clk_mux_sel0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>clk_lp_ready</name>
                     <description>clk_lp_ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_locked</name>
                     <description>PLL_locked</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTAL_ready</name>
                     <description>XTAL_ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_out</name>
                     <description>pll_lock_out</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>xtal_ready_out</name>
                     <description>xtal_ready_out</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_STATUS_REG2</name>
               <description>SUBSYS_STATUS_REG2</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_NUM</name>
                     <description>PART_NUM</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>VERSION_NUM</name>
                     <description>VERSION_NUM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
