Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31032_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DAC_CTRL</name>
         <version>05063A.3 Draft</version>
         <description>Descriptive Title of Macro</description>
         <baseAddress>0x44003C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DACCON</name>
               <description>CONTROL Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>LPRCEN1</name>
                     <description>LPRC clock enabled for SnH mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LPRCEN1Select</name>
                        <enumeratedValue>
                           <name>LPRC_ENABLE</name>
                           <description>LPRC clock not enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPRC_DISABLE</name>
                           <description>LPRC clock enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTEN</name>
                     <description>Will enable the output buffer</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OUTENSelect</name>
                        <enumeratedValue>
                           <name>OUTEN_DISABLE</name>
                           <description>Output buffer disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTEN_ENABLE</name>
                           <description>Output buffer enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SNH</name>
                     <description>Sample and hold circuitry</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SNHSelect</name>
                        <enumeratedValue>
                           <name>SNH_NORMAL</name>
                           <description>DAC operation in normal mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SNH_LOWPOWER</name>
                           <description>DAC operation in low power mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ENSelect</name>
                        <enumeratedValue>
                           <name>DAC_DISABLE</name>
                           <description>The peripheral is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC_ENABLE</name>
                           <description>The peripheral is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACCODE</name>
               <description>DAC CODE Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DAC data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACCON2</name>
               <description>DAC Config register1</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>WIDTH</name>
                     <description>SnH clock width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>SnH clock period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>PRESCALAR</name>
                     <description>Prescaling factor for SnH clock</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
