Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31032_SL3.svd
            <register>
               <name>PID2</name>
               <description>Peripheral Identification 2</description>
               <addressOffset>0x1FE8</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>JEPIDCH</name>
                     <description>JEP-106 Identity Code High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEPU</name>
                     <description>JEP-106 Identity Code is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID3</name>
               <description>Peripheral Identification 3</description>
               <addressOffset>0x1FEC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CUSMOD</name>
                     <description>ARM CUSMOD</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>Revision Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID0</name>
               <description>Component Identification 0</description>
               <addressOffset>0x1FF0</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB0</name>
                     <description>Preamble Byte 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID1</name>
               <description>Component Identification 1</description>
               <addressOffset>0x1FF4</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLE</name>
                     <description>Preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCLASS</name>
                     <description>Component Class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID2</name>
               <description>Component Identification 2</description>
               <addressOffset>0x1FF8</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB2</name>
                     <description>Preamble Byte 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID3</name>
               <description>Component Identification 3</description>
               <addressOffset>0x1FFC</addressOffset>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB3</name>
                     <description>Preamble Byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DWT</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Data Watchpoint and Trace Register</description>
         <baseAddress>0xE0001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x5C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>CYCCNTENA</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTPRESET</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>POSTINIT</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CYCTAP</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCTAP</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PCSAMPLENA</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCTRCENA</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPIEVTENA</name>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCEVTENA</name>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLEEPEVTENA</name>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSUEVTENA</name>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FOLDEVTENA</name>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCEVTENA</name>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOPRFCNT</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOCYCCNT</name>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOEXTTRIG</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOTRCPKT</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NUMCOMP</name>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CYCCNT</name>
               <description>Cycle Count Register</description>
               <addressOffset>0x4</addressOffset>
            </register>
            <register>
               <name>CPICNT</name>
               <description>CPI Count Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>CPICNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXCCNT</name>
               <description>Exception Overhead Count Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>EXCCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLEEPCNT</name>
               <description>Sleep Count Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>SLEEPCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LSUCNT</name>
               <description>LSU Count Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>LSUCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOLDCNT</name>
               <description>Folded-instruction Count Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>FOLDCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCSR</name>
               <description>Program Counter Sample Register</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
            </register>
            <register>
               <name>COMP0</name>
               <description>Comparator Register 0</description>
               <addressOffset>0x20</addressOffset>
            </register>
            <register>
               <name>MASK0</name>
               <description>Mask Register 0</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>MASK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FUNCTION0</name>
               <description>Function Register 0</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>FUNCTION</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EMITRANGE</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCMATCH</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVMATCH</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNK1ENA</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVSIZE</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR0</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR1</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MATCHED</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP1</name>
               <description>Comparator Register 1</description>
               <addressOffset>0x30</addressOffset>
            </register>
            <register>
               <name>MASK1</name>
               <description>Mask Register 1</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>MASK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FUNCTION1</name>
               <description>Function Register 1</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>FUNCTION</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EMITRANGE</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCMATCH</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVMATCH</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNK1ENA</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVSIZE</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR0</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR1</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MATCHED</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP2</name>
               <description>Comparator Register 2</description>
               <addressOffset>0x40</addressOffset>
            </register>
            <register>
               <name>MASK2</name>
               <description>Mask Register 2</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>MASK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FUNCTION2</name>
               <description>Function Register 2</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>FUNCTION</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EMITRANGE</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCMATCH</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVMATCH</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNK1ENA</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVSIZE</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR0</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR1</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MATCHED</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP3</name>
               <description>Comparator Register 3</description>
               <addressOffset>0x50</addressOffset>
            </register>
            <register>
               <name>MASK3</name>
               <description>Mask Register 3</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>MASK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FUNCTION3</name>
               <description>Function Register 3</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>FUNCTION</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EMITRANGE</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYCMATCH</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVMATCH</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNK1ENA</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAVSIZE</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR0</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAVADDR1</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MATCHED</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
