Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31032_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RAMECC</name>
         <version>U22681.0.0</version>
         <description>RAM ECC</description>
         <baseAddress>0x41008000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RAMECC</name>
            <description>RAM Error Correction Code</description>
            <value>11</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SINGLEE</name>
                     <description>Single Bit ECC Error Interrupt Enable Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUALE</name>
                     <description>Dual Bit ECC Error Interrupt Enable Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SINGLEE</name>
                     <description>Single Bit ECC Error Interrupt Enable Set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUALE</name>
                     <description>Dual Bit ECC Error Interrupt Enable Set</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SINGLEE</name>
                     <description>Single Bit ECC Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUALE</name>
                     <description>Dual Bit ECC Error Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ECCDIS</name>
                     <description>ECC Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERRADDR</name>
               <description>Error Address</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADDR</name>
                     <description>Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0xF</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>ECCDIS</name>
                     <description>ECC Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECCELOG</name>
                     <description>ECC Error Log</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>RCON</name>
         <version>031001.0</version>
         <alternatePeripheral>CRU</alternatePeripheral>
         <baseAddress>0x44000A00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x60</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCON</name>
               <description>RESET CONTROL REGISTER</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x3</resetValue>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power-On Reset Flag bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PORSelect</name>
                        <enumeratedValue>
                           <name>POR</name>
                           <description>A Power-up Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_POR</name>
                           <description>A Power-up Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOR</name>
                     <description>Brown-out Reset Flag bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BORSelect</name>
                        <enumeratedValue>
                           <name>BOR</name>
                           <description>A Brown-out Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_BOR</name>
                           <description>A Brown-out Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>Wake from Idle Flag bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IDLESelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Device was in Idle mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_IDLE</name>
                           <description>Device was not in Idle mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLEEP</name>
                     <description>Wake from Sleep Flag bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SLEEPSelect</name>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>Device has been in Sleep mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_SLEEP</name>
                           <description>Device has not been in Sleep mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDTO</name>
                     <description>Watchdog Timer Time-Out Flag bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WDTOSelect</name>
                        <enumeratedValue>
                           <name>WDTO</name>
                           <description>WDT Time-out has occurred and caused a reset.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_WDTO</name>
                           <description>WDT Time-out has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMTO</name>
                     <description>Deadman Timer Time-Out Flag bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DMTOSelect</name>
                        <enumeratedValue>
                           <name>DMTO</name>
                           <description>DMT Time-out has occurred and caused a reset.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_DMTO</name>
                           <description>DMT Time-out has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWR</name>
                     <description>Software Reset Flag bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SWRSelect</name>
                        <enumeratedValue>
                           <name>SWR</name>
                           <description>A Software Commanded Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_SWR</name>
                           <description>A Software Commanded Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTR</name>
                     <description>External Reset (MCLR) Status bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EXTRSelect</name>
                        <enumeratedValue>
                           <name>EXTR</name>
                           <description>A Master Clear (pin) Reset has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_EXTR</name>
                           <description>A Master Clear (pin) Reset has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMR</name>
                     <description>Configuration Mismatch Flag bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMRSelect</name>
                        <enumeratedValue>
                           <name>CMR</name>
                           <description>A Configuration Mismatch Reset Event has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_CMR</name>
                           <description>A Configuration Mismatch Reset Event has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPSLP</name>
                     <description>DPSLP Deep Sleep Mode Flag Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DPSLPSelect</name>
                        <enumeratedValue>
                           <name>DSLP</name>
                           <description>Deep Sleep Mode has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_DSLP</name>
                           <description>Deep Sleep Mode has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVMEOL</name>
                     <description>NVM End of Life Flag Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>NVMEOLSelect</name>
                        <enumeratedValue>
                           <name>NO_NVMEOL</name>
                           <description>A NVM EOL Failure has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVMEOL</name>
                           <description>A NVM EOL Failure has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVMLTA</name>
                     <description>NVM Life Time Alert Flag Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>NVMLTASelect</name>
                        <enumeratedValue>
                           <name>NO_NVMLTA</name>
                           <description>A NVM LTA Error has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVMLTA</name>
                           <description>A NVM LTA Error has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BCFGFAIL</name>
                     <description>BCFG Failure Flag Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BCFGFAILSelect</name>
                        <enumeratedValue>
                           <name>NO_BCFGFAIL</name>
                           <description>A BCFG Failure has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCFGFAIL</name>
                           <description>A BCFG Failure has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BCFGERR</name>
                     <description>BCFG Error Flag Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BCFGERRSelect</name>
                        <enumeratedValue>
                           <name>NO_BCFGERR</name>
                           <description>A BCFG Error has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCFGERR</name>
                           <description>A BCFG Error has occurred.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORCORE</name>
                     <description>Core Voltage POR Flag bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PORCORESelect</name>
                        <enumeratedValue>
                           <name>PORCORE</name>
                           <description>A Power-up Reset has occurred due to Core Voltage.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_PORCORE</name>
                           <description>A Power-up Reset has not occurred due to Core Voltage.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORIO</name>
                     <description>IO Voltage POR Flag bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PORIOSelect</name>
                        <enumeratedValue>
                           <name>PORIO</name>
                           <description>A Power-up Reset has occurred due to IO Voltage.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_PORIO</name>
                           <description>A Power-up Reset has not occurred due to IO Voltage.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCONCLR</name>
               <addressOffset>0x34</addressOffset>
            </register>
            <register>
               <name>RCONSET</name>
               <addressOffset>0x38</addressOffset>
            </register>
            <register>
               <name>RCONINV</name>
               <addressOffset>0x3C</addressOffset>
            </register>
