Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31032_SL3.svd
               <register>
                  <name>RNG_CONTROL_CONTROL</name>
                  <description>Control register</description>
                  <addressOffset>0x1000</addressOffset>
                  <fields>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable the NDRNG.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LFSREN</name>
                        <description>Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1').</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTEN</name>
                        <description>Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode).</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CONDBYPASS</name>
                        <description>0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly).</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTENREP</name>
                        <description>Interrupt enable for Repetition Count Test failure.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTENPROP</name>
                        <description>Interrupt enable for Adaptive Proportion Test failure (1024-sample window).</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTENFULL</name>
                        <description>Interrupt enable for FIFO full.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFTRST</name>
                        <description>Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTENPRE</name>
                        <description>Interrupt enable for AIS31 preliminary noise alarm.</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTENALM</name>
                        <description>Interrupt enable for AIS31 noise alarm.</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEACTIVEROS</name>
                        <description>Force oscillators to run when FIFO is full.</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HEALTHTESTBYPASS</name>
                        <description>Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state.</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AIS31BYPASS</name>
                        <description>Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state.</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HEALTHTESTSEL</name>
                        <description>Select input to health test module: 0: Before conditioning, 1: After conditioning.</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AIS31TESTSEL</name>
                        <description>Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning.</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NB128BITBLOCKS</name>
                        <description>Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>FIFOWRITESTARTUP</name>
                        <description>Enable write of the samples in the FIFO during start-up.</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_FIFOLEVEL</name>
                  <description>FIFO level register.</description>
                  <addressOffset>0x1004</addressOffset>
                  <fields>
                     <field>
                        <name>FIFOLEVEL</name>
                        <description>Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_FIFOTHRESHOLD</name>
                  <description>FIFO threshold register.</description>
                  <addressOffset>0x1008</addressOffset>
                  <fields>
                     <field>
                        <name>FIFOTHRESHOLD</name>
                        <description>FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_FIFODEPTH</name>
                  <description>FIFO depth register.</description>
                  <addressOffset>0x100C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>FIFODEPTH</name>
                        <description>Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_KEY0</name>
                  <description>Key register (MSB).</description>
                  <addressOffset>0x1010</addressOffset>
                  <fields>
                     <field>
                        <name>KEY0</name>
                        <description>Key register (MSB).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_KEY1</name>
                  <description>Key register.</description>
                  <addressOffset>0x1014</addressOffset>
                  <fields>
                     <field>
                        <name>KEY1</name>
                        <description>Key register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_KEY2</name>
                  <description>Key register.</description>
                  <addressOffset>0x1018</addressOffset>
                  <fields>
                     <field>
                        <name>KEY2</name>
                        <description>Key register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_KEY3</name>
                  <description>Key register (LSB).</description>
                  <addressOffset>0x101C</addressOffset>
                  <fields>
                     <field>
                        <name>KEY3</name>
                        <description>Key register (LSB).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_TESTDATA</name>
                  <description>Test data register.</description>
                  <addressOffset>0x1020</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>TESTDATA</name>
                        <description>Test data register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_REPEATTHRESHOLD</name>
                  <description>Repetition Test Count Cut-Off value.</description>
                  <addressOffset>0x1024</addressOffset>
                  <fields>
                     <field>
                        <name>REPEATTHRESHOLD</name>
                        <description>Repetition Test Count Cut-Off value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_PROPTHRESHOLD</name>
                  <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                  <addressOffset>0x1028</addressOffset>
                  <fields>
                     <field>
                        <name>PROPTHRESHOLD</name>
                        <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_STATUS</name>
                  <description>Status register.</description>
                  <addressOffset>0x1030</addressOffset>
                  <fields>
                     <field>
                        <name>TESTDATABUSY</name>
                        <description>High when data written to TestData register is being processed. (see section 4.7)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STATE</name>
                        <description>State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>REPFAIL</name>
                        <description>NIST-800-90B repetition Count Test interrupt status.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PROPFAIL</name>
                        <description>NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FULLINT</name>
                        <description>FIFO full status.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PREINT</name>
                        <description>AIS31 preliminary noise alarm interrupt status.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALMINT</name>
                        <description>AIS31 noise alarm interrupt status.</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STARTUPFAIL</name>
                        <description>Start-up test failure.</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOACCFAIL</name>
                        <description>Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0).</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_INITWAITVAL</name>
                  <description>Initial wait counter value.</description>
                  <addressOffset>0x1034</addressOffset>
                  <resetValue>0x0000FFFF</resetValue>
                  <fields>
                     <field>
                        <name>INITWAITVAL</name>
                        <description>Number of clock cycles to wait before sampling data from the noise source.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_DISABLEOSC0</name>
                  <description>Disable oscillator rings #0 to #31.</description>
                  <addressOffset>0x1038</addressOffset>
                  <fields>
                     <field>
                        <name>DISABLEOSC0</name>
                        <description>Disable oscillator rings #0 to #31.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_DISABLEOSC1</name>
                  <description>Disable oscillator rings #32 to #63.</description>
                  <addressOffset>0x103C</addressOffset>
                  <fields>
                     <field>
                        <name>DISABLEOSC1</name>
                        <description>Disable oscillator rings #32 to #63.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_SWOFFTMRVAL</name>
                  <description>Switch off timer value.</description>
                  <addressOffset>0x1040</addressOffset>
                  <fields>
                     <field>
                        <name>SWOFFTMRVAL</name>
                        <description>Number of clk cycles to wait before stopping the rings after the FIFO is full.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_CLKDIV</name>
                  <description>Sample clock divider.</description>
                  <addressOffset>0x1044</addressOffset>
                  <fields>
                     <field>
                        <name>CLKDIV</name>
                        <description>Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_AIS31CONF0</name>
                  <description>AIS31 configuration register 0.</description>
                  <addressOffset>0x1048</addressOffset>
                  <fields>
                     <field>
                        <name>STARTUPTHRESHOLD</name>
                        <description>Start-up test threshold.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>ONLINETHRESHOLD</name>
                        <description>Online threshold.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_AIS31CONF1</name>
                  <description>AIS31 configuration register 1.</description>
                  <addressOffset>0x104C</addressOffset>
                  <fields>
                     <field>
                        <name>ONLINEREPTHRESHOLD</name>
                        <description>Online repeat threshold.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>HEXPECTEDVALUE</name>
                        <description>Expected history value.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_AIS31CONF2</name>
                  <description>AIS31 configuration register 2.</description>
                  <addressOffset>0x1050</addressOffset>
                  <fields>
                     <field>
                        <name>HMIN</name>
                        <description>Minimum allowed history value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>HMAX</name>
                        <description>Maximum allowed history value.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_AIS31STATUS</name>
                  <description>AIS31 status register.</description>
                  <addressOffset>0x1054</addressOffset>
                  <fields>
                     <field>
                        <name>NUMPRELIMALARMS</name>
                        <description>Number of preliminary noise alarms since counter was last cleared.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PRELIMNOISEALARMRNG</name>
                        <description>Last preliminary noise alarm occurred due to history value out of range.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRELIMNOISEALARMREP</name>
                        <description>Last preliminary noise alarm occurred due to consecutive high X**2.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_HWCONFIG</name>
                  <description>Hardware configuration register.</description>
                  <addressOffset>0x1058</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>NUMBOFRINGS</name>
                        <description>Generic g_NumRings value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>AIS31</name>
                        <description>Generic g_AIS31 value.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AIS31Full</name>
                        <description>Generic g_AIS31Full value.</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
